unicab369/ch32mess/ch32fun/ch58xhw.h
/* System: safe accessing register */
#define R32_SAFE_ACCESS     (*((vu32*)0x40001040)) // RW, safe accessing
#define R8_SAFE_ACCESS_SIG  (*((vu8*)0x40001040))  // WO, safe accessing sign register, must write SAFE_ACCESS_SIG1 then SAFE_ACCESS_SIG2 to enter safe accessing mode
#define  RB_SAFE_ACC_MODE   0x03                      // RO, current safe accessing mode: 11=safe/unlocked (SAM), other=locked (00..01..10..11)
#define  RB_SAFE_ACC_ACT    0x04                      // RO, indicate safe accessing on
#define  RB_SAFE_ACC_TIMER  0xF8                      // RO, safe accessing mode closed
#define SAFE_ACCESS_SIG1    0x57                      // WO: safe accessing sign value step 1
#define SAFE_ACCESS_SIG2    0xA8                      // WO: safe accessing sign value step 2
#define SAFE_ACCESS_SIG0    0x00                      // WO: safe accessing sign value for disable
#define R8_CHIP_ID          (*((vu8*)0x40001041))  // RF, chip ID register, always is ID_CH58*
#define SYS_SAFE_ACCESS(a)  do { R8_SAFE_ACCESS_SIG = SAFE_ACCESS_SIG1; \
								 R8_SAFE_ACCESS_SIG = SAFE_ACCESS_SIG2; \
								 asm volatile ("nop\nnop"); \
								 {a} \
								 R8_SAFE_ACCESS_SIG = SAFE_ACCESS_SIG0; \
								 asm volatile ("nop\nnop"); } while(0)

/*System: Miscellaneous Control register */
#define R32_MISC_CTRL       (*((vu32*)0x40001048)) // RWA, miscellaneous control register
#define R8_PLL_CONFIG       (*((vu8*)0x4000104B))  // RWA, PLL configuration control, SAM
#define  RB_PLL_CFG_DAT     0x7F                      // RWA, PLL configuration control, SAM

/* System: 32MHz oscillator control register */
#define R8_XT32M_TUNE       (*((vu8*)0x4000104E))  // RWA, external 32MHz oscillator tune control, SAM
#define  RB_XT32M_C_LOAD    0x70                      // RWA, external 32MHz oscillator load capacitor tune: Cap = RB_XT32M_C_LOAD * 2 + 10pF
#define  RB_XT32M_I_BIAS    0x03                      // RWA, external 32MHz oscillator bias current tune: 00=75% current, 01=standard current, 10=125% current, 11=150% current

/*System: Miscellaneous Control register */
#define R32_MISC_CTRL       (*((vu32*)0x40001048)) // RWA, miscellaneous control register
#define R8_PLL_CONFIG       (*((vu8*)0x4000104B))  // RWA, PLL configuration control, SAM
#define  RB_FLASH_IO_MOD    0x80                      // RWA, flash ROM interface mode, SAM
#define  RB_PLL_CFG_DAT     0x7F                      // RWA, PLL configuration control, SAM

/* System: 32MHz oscillator control register */
#define R32_OSC32M_CTRL     (*((vu32*)0x4000104C)) // RWA, 32MHz oscillator control, SAM
#define R8_XT32M_TUNE       (*((vu8*)0x4000104E))  // RWA, external 32MHz oscillator tune control, SAM
#define  RB_XT32M_I_BIAS    0x03                      // RWA, external 32MHz oscillator bias current tune: 00=75% current, 01=standard current, 10=125% current, 11=150% current
#define  RB_XT32M_C_LOAD    0x70                      // RWA, external 32MHz oscillator load capacitor tune: Cap = RB_XT32M_C_LOAD * 2 + 10pF

/* System: oscillator frequency calibration register */
#define R32_OSC_CALIB       (*((vu32*)0x40001050)) // RWA, oscillator frequency calibration, SAM
#define R16_OSC_CAL_CNT     (*((vu16*)0x40001050)) // RO, system clock count value for 32KHz multi-cycles
#define  RB_OSC_CAL_CNT     0x3FFF                    // RO, system clock count value for 32KHz multi-cycles
#define  RB_OSC_CAL_OV_CLR  0x4000                    // RW1, indicate R8_OSC_CAL_OV_CNT not zero, set 1 to clear R8_OSC_CAL_OV_CNT
#define  RB_OSC_CAL_IF      0x8000                    // RW1, interrupt flag for oscillator capture end, set 1 to clear
#define R8_OSC_CAL_OV_CNT   (*((vu8*)0x40001052))  // RO, oscillator frequency calibration overflow times
#define R8_OSC_CAL_CTRL     (*((vu8*)0x40001053))  // RWA, oscillator frequency calibration control, SAM
#define  RB_OSC_CNT_TOTAL   0x07                      // RWA, total cycles mode for oscillator capture
// RB_OSC_CNT_TOTAL: select total cycles for oscillator capture
//    000: 1
//    001: 2
//    010: 4
//    011: 32
//    100: 64
//    101: 128
//    110: 1024
//    111: 2047
#define  RB_OSC_CNT_HALT    0x08                      // RO, calibration counter halt status: 0=counting, 1=halt for reading count value
#define  RB_OSC_CAL_IE      0x10                      // RWA, interrupt enable for oscillator capture end
#define  RB_OSC_CNT_EN      0x20                      // RWA, calibration counter enable
#define  RB_OSC_CNT_END     0x40                      // RWA, select oscillator capture end mode: 0=normal, 1=append 2 cycles

/* System: ADC and Touch-key register */
#define R32_ADC_CTRL        (*((vu32*)0x40001058)) // RW, ADC control
#define R8_ADC_CHANNEL      (*((vu8*)0x40001058))  // RW, ADC input channel selection
#define  RB_ADC_CH_INX      0x0F                      // RW, ADC input channel index
#define R8_ADC_CFG          (*((vu8*)0x40001059))  // RW, ADC configure
#define  RB_ADC_POWER_ON    0x01                      // RW, ADC power control: 0=power down, 1=power on
#define  RB_ADC_BUF_EN      0x02                      // RW, ADC input buffer enable 
#define  RB_ADC_DIFF_EN     0x04                      // RW, ADC input channel mode: 0=single-end, 1=differnetial
#define  RB_ADC_OFS_TEST    0x08                      // RW, enable ADC offset test mode: 0=normal mode, 1=short to test offset
#define  RB_ADC_PGA_GAIN    0x30                      // RW, set ADC input PGA gain: 00=-12dB, 01=-6dB, 10=0dB, 11=6dB
#define  RB_ADC_CLK_DIV     0xC0                      // RW, select ADC clock frequency: 00=3.2MHz, 01=8MHz, 10=5.33MHz, 11=4MHz
#define R8_ADC_CONVERT      (*((vu8*)0x4000105A))  // RW, ADC convert control
#define  RB_ADC_START       0x01                      // RW, ADC convert start control: 0=stop ADC convert, 1=start an ADC convert, auto clear
#define  RB_ADC_EOC_X       0x80                      // RO, end of ADC conversion flag
#define R8_TEM_SENSOR       (*((vu8*)0x4000105B))  // RW, temperature sensor control
#define  RB_TEM_SEN_PWR_ON  0x80                      // RW, temperature sensor power control: 0=power down, 1=power on
#define R32_ADC_DATA        (*((vu32*)0x4000105C)) // RO, ADC data and status
#define R16_ADC_DATA        (*((vu16*)0x4000105C)) // RO, ADC data
#define  RB_ADC_DATA        0x0FFF                    // RO, ADC conversion data
#define R8_ADC_INT_FLAG     (*((vu8*)0x4000105E))  // RO, ADC interrupt flag register
#define  RB_ADC_IF_EOC      0x80                      // RO, ADC conversion interrupt flag: 0=free or converting, 1=end of conversion, interrupt action, auto ADC or write R8_ADC_CONVERT or write R8_TKEY_CONVERT to clear flag
#define R32_TKEY_CTRL       (*((vu8*)0x40001054))  // RW, Touchkey control
#define R8_TKEY_COUNT       (*((vu8*)0x40001054))  // RW, Touchkey charge and discharge count
#define  RB_TKEY_CHARG_CNT  0x1F                      // RW, Touchkey charge count
#define  RB_TKEY_DISCH_CNT  0xE0                      // RW, Touchkey discharge count
#define R8_TKEY_CONVERT     (*((vu8*)0x40001056))  // RW, Touchkey convert control
#define  RB_TKEY_START      0x01                      // RW, Touchkey convert start control: 0=stop Touchkey convert, 1=start a Touchkey convert, auto clear
#define R8_TKEY_CFG         (*((vu8*)0x40001057))  // RW, Touchkey configure
#define  RB_TKEY_PWR_ON     0x01                      // RW, Touchkey power on: 0=power down, 1=power on
#define  RB_TKEY_CURRENT    0x02                      // RW, Touchkey charge current selection: 0=35uA, 1=70uA
#define  RB_TKEY_DRV_EN     0x04                      // RW, Touchkey drive shield enable
#define  RB_TKEY_PGA_ADJ    0x08                      // RW, ADC input PGA speed selection: 0=slow, 1=fast
#define R32_ADC_DMA_CTRL    (*((vu32*)0x40001060)) // RW, ADC DMA control
#define R8_ADC_CTRL_DMA     (*((vu8*)0x40001061))  // RW, ADC DMA control
#define  RB_ADC_DMA_ENABLE  0x01                      // RW, ADC DMA enable
#define  RB_ADC_DMA_LOOP    0x04                      // RW, ADC DMA address loop enable
#define  RB_ADC_IE_DMA_END  0x08                      // RW, enable interrupt for ADC DMA completion
#define  RB_ADC_IE_EOC      0x10                      // RW, enable interrupt for end of ADC conversion
#define  RB_ADC_CONT_EN     0x40                      // RW, enable contineous conversion ADC
#define  RB_ADC_AUTO_EN     0x80                      // RW, enable auto continuing ADC for DMA
#define R8_ADC_DMA_IF       (*((vu8*)0x40001062))  // RW1, ADC interrupt flag
#define  RB_ADC_IF_DMA_END  0x08                      // RW1, interrupt flag for ADC DMA completion
#define  RB_ADC_IF_END_ADC  0x10                      // RW1, interrupt flag for end of ADC conversion, DMA for auto ADC or write R8_ADC_CONVERT to clear flag
#define R8_ADC_AUTO_CYCLE   (*((vu8*)0x40001063))  // RW, auto ADC cycle value, unit is 16 Fsys
#define R32_ADC_DMA_NOW     (*((vu32*)0x40001064)) // RW, ADC DMA current address
#define R16_ADC_DMA_NOW     (*((vu16*)0x40001064)) // RW, ADC DMA current address
#define R32_ADC_DMA_BEG     (*((vu32*)0x40001068)) // RW, ADC DMA begin address
#define R16_ADC_DMA_BEG     (*((vu16*)0x40001068)) // RW, ADC DMA begin address
#define R32_ADC_DMA_END     (*((vu32*)0x4000106C)) // RW, ADC DMA end address
#define R16_ADC_DMA_END     (*((vu16*)0x4000106C)) // RW, ADC DMA end address

/* System: Flash ROM control register */
#define R32_FLASH_DATA      (*((vu32*)0x40001800)) // RO/WO, flash ROM data
#define R32_FLASH_CONTROL   (*((vu32*)0x40001804)) // RW, flash ROM control
#define R8_FLASH_DATA       (*((vu8*)0x40001804))  // RO/WO, flash ROM data buffer
#define R8_FLASH_CTRL       (*((vu8*)0x40001806))  // RW, flash ROM access control
#define R8_FLASH_CFG        (*((vu8*)0x40001807))  // RW, flash ROM access config, SAM

/* System: GPIO interrupt control register */
#define R32_GPIO_INT_EN     (*((vu32*)0x40001090)) // RW, GPIO interrupt enable
#define R16_PA_INT_EN       (*((vu16*)0x40001090)) // RW, GPIO PA interrupt enable
#define R16_PB_INT_EN       (*((vu16*)0x40001092)) // RW, GPIO PB interrupt enable
#define R32_GPIO_INT_MODE   (*((vu32*)0x40001094)) // RW, GPIO interrupt mode: 0=level action, 1=edge action
#define R16_PA_INT_MODE     (*((vu16*)0x40001094)) // RW, GPIO PA interrupt mode: 0=level action, 1=edge action
#define R16_PB_INT_MODE     (*((vu16*)0x40001096)) // RW, GPIO PB interrupt mode: 0=level action, 1=edge action
#define R32_GPIO_INT_IF     (*((vu32*)0x4000109C)) // RW1, GPIO interrupt flag
#define R16_PA_INT_IF       (*((vu16*)0x4000109C)) // RW1, GPIO PA interrupt flag
#define R16_PB_INT_IF       (*((vu16*)0x4000109E)) // RW1, GPIO PB interrupt flag

/* GPIO PA register */
#define R32_PA_DIR          (*((vu32*)0x400010A0)) // RW, GPIO PA I/O direction: 0=in, 1=out
#define R32_PA_PIN          (*((vu32*)0x400010A4)) // RO, GPIO PA input
#define R32_PA_OUT          (*((vu32*)0x400010A8)) // RW, GPIO PA output
#define R32_PA_CLR          (*((vu32*)0x400010AC)) // WZ, GPIO PA clear output: 0=keep, 1=clear
#define R32_PA_PU           (*((vu32*)0x400010B0)) // RW, GPIO PA pullup resistance enable
#define R32_PA_PD_DRV       (*((vu32*)0x400010B4)) // RW, PA pulldown for input or PA driving capability for output
#define R32_PA_SET          (*((vu32*)0x400010B8)) // RW, PA set high for output ,1=set output high,0=IDLE

/* GPIO PB register */
#define R32_PB_DIR          (*((vu32*)0x400010C0)) // RW, GPIO PB I/O direction: 0=in, 1=out
#define R32_PB_PIN          (*((vu32*)0x400010C4)) // RO, GPIO PB input
#define R32_PB_OUT          (*((vu32*)0x400010C8)) // RW, GPIO PB output
#define R32_PB_CLR          (*((vu32*)0x400010CC)) // WZ, GPIO PB clear output: 0=keep, 1=clear
#define R32_PB_PU           (*((vu32*)0x400010D0)) // RW, GPIO PB pullup resistance enable
#define R32_PB_PD_DRV       (*((vu32*)0x400010D4)) // RW, PB pulldown for input or PB driving capability for output
#define R32_PB_SET          (*((vu32*)0x400010D8)) // RW, PB set high for output ,1=set output high,0=IDLE

#define PA0      (0x00000001) /*!< Pin 0 selected */
#define PA1      (0x00000002) /*!< Pin 1 selected */
#define PA2      (0x00000004) /*!< Pin 2 selected */
#define PA3      (0x00000008) /*!< Pin 3 selected */
#define PA4      (0x00000010) /*!< Pin 4 selected */
#define PA5      (0x00000020) /*!< Pin 5 selected */
#define PA6      (0x00000040) /*!< Pin 6 selected */
#define PA7      (0x00000080) /*!< Pin 7 selected */
#define PA8      (0x00000100) /*!< Pin 8 selected */
#define PA9      (0x00000200) /*!< Pin 9 selected */
#define PA10     (0x00000400) /*!< Pin 10 selected */
#define PA11     (0x00000800) /*!< Pin 11 selected */
#define PA12     (0x00001000) /*!< Pin 12 selected */
#define PA13     (0x00002000) /*!< Pin 13 selected */
#define PA14     (0x00004000) /*!< Pin 14 selected */
#define PA15     (0x00008000) /*!< Pin 15 selected */

#define PB       (0x80000000) /* Bit mask to indicate bank B */
#define PB0      (0x80000001) /*!< Pin 0 selected */
#define PB1      (0x80000002) /*!< Pin 1 selected */
#define PB2      (0x80000004) /*!< Pin 2 selected */
#define PB3      (0x80000008) /*!< Pin 3 selected */
#define PB4      (0x80000010) /*!< Pin 4 selected */
#define PB5      (0x80000020) /*!< Pin 5 selected */
#define PB6      (0x80000040) /*!< Pin 6 selected */
#define PB7      (0x80000080) /*!< Pin 7 selected */
#define PB8      (0x80000100) /*!< Pin 8 selected */
#define PB9      (0x80000200) /*!< Pin 9 selected */
#define PB10     (0x80000400) /*!< Pin 10 selected */
#define PB11     (0x80000800) /*!< Pin 11 selected */
#define PB12     (0x80001000) /*!< Pin 12 selected */
#define PB13     (0x80002000) /*!< Pin 13 selected */
#define PB14     (0x80004000) /*!< Pin 14 selected */
#define PB15     (0x80008000) /*!< Pin 15 selected */
#define PB16     (0x80010000) /*!< Pin 16 selected */
#define PB17     (0x80020000) /*!< Pin 17 selected */
#define PB18     (0x80040000) /*!< Pin 18 selected */
#define PB19     (0x80080000) /*!< Pin 19 selected */
#define PB20     (0x80100000) /*!< Pin 20 selected */
#define PB21     (0x80200000) /*!< Pin 21 selected */
#define PB22     (0x80400000) /*!< Pin 22 selected */
#define PB23     (0x80800000) /*!< Pin 23 selected */
#define P_All    (0xFFFFFFFF) /*!< All pins selected */

/* GPIO alias name */
#define  bAIN9   (1<<0)    // PA0
#define  bSCK1   (1<<0)    // PA0
#define  bAIN8   (1<<1)    // PA1
#define  bSDO    (1<<1)    // PA1
#define  bMOSI1  bSDO
#define  bAIN7   (1<<2)    // PA2
#define  bTMR3_  (1<<2)    // PA2
#define  bCAP3_  bTMR3_
#define  bPWM3_  bTMR3_
#define  bSDI    (1<<2)    // PA2
#define  bMISO1  bSDI
#define  bAIN6   (1<<3)    // PA3
#define  bAIN0   (1<<4)    // PA4
#define  bRXD3   (1<<4)    // PA4
#define  bAIN1   (1<<5)    // PA5
#define  bTXD3   (1<<5)    // PA5
#define  bAIN10  (1<<6)    // PA6
#define  bRXD2   (1<<6)    // PA6
#define  bPWM4_  (1<<6)    // PA6
#define  bAIN11  (1<<7)    // PA7
#define  bTXD2   (1<<7)    // PA7
#define  bPWM5_  (1<<7)    // PA7
#define  bAIN12  (1<<8)    // PA8
#define  bRXD1   (1<<8)    // PA8
#define  bAIN13  (1<<9)    // PA9
#define  bTMR0   (1<<9)    // PA9
#define  bCAP0   bTMR0
#define  bPWM0   bTMR0
#define  bTXD1   (1<<9)    // PA9
#define  bX32KI  (1<<10)   // PA10
#define  bTMR1   (1<<10)   // PA10
#define  bCAP1   bTMR1
#define  bPWM1   bTMR1
#define  bX32KO  (1<<11)   // PA11
#define  bTMR2   (1<<11)   // PA11
#define  bCAP2   bTMR2
#define  bPWM2   bTMR2
#define  bAIN2   (1<<12)   // PA12
#define  bPWM4   (1<<12)   // PA12
#define  bSCS    (1<<12)   // PA12
#define  bAIN3   (1<<13)   // PA13
#define  bSCK0   (1<<13)   // PA13
#define  bPWM5   (1<<13)   // PA13
#define  bAIN4   (1<<14)   // PA14
#define  bMOSI   (1<<14)   // PA14
#define  bTXD0_  (1<<14)   // PA14
#define  bAIN5   (1<<15)   // PA15
#define  bMISO   (1<<15)   // PA15
#define  bRXD0_  (1<<15)   // PA15
#define  bPWM6   (1<<0)    // PB0
#define  bCTS    (1<<0)    // PB0
#define  bDSR    (1<<1)    // PB1
#define  bPWM7_  (1<<1)    // PB1
#define  bRI     (1<<2)    // PB2
#define  bPWM8_  (1<<2)    // PB2
#define  bDCD    (1<<3)    // PB3
#define  bPWM9_  (1<<3)    // PB3
#define  bPWM7   (1<<4)    // PB4
#define  bRXD0   (1<<4)    // PB4
#define  bDTR    (1<<5)    // PB5
#define  bRTS    (1<<6)    // PB6
#define  bPWM8   (1<<6)    // PB6
#define  bTXD0   (1<<7)    // PB7
#define  bPWM9   (1<<7)    // PB7
#define  bUDM    (1<<10)   // PB10
#define  bTMR1_  (1<<10)   // PB10
#define  bCAP1_  bTMR1_
#define  bPWM1_  bTMR1_
#define  bUDP    (1<<11)   // PB11
#define  bTMR2_  (1<<11)   // PB11
#define  bCAP2_  bTMR2_
#define  bPWM2_  bTMR2_
#define  bU2DM   (1<<12)   // PB12
#define  bSCS_   (1<<12)   // PB12
#define  bSDA    (1<<12)   // PB12
#define  bRXD1_  (1<<12)   // PB12
#define  bU2DP   (1<<13)   // PB13
#define  bSCK0_  (1<<13)   // PB13
#define  bSCL    (1<<13)   // PB13
#define  bTXD1_  (1<<13)   // PB13
#define  bTIO    (1<<14)   // PB14
#define  bDSR_   (1<<14)   // PB14
#define  bMOSI_  (1<<14)   // PB14
#define  bPWM10  (1<<14)   // PB14
#define  bTCK    (1<<15)   // PB15
#define  bMISO_  (1<<15)   // PB15
#define  bDTR_   (1<<15)   // PB15
#define  bSDA_   (1<<20)   // PB20
#define  bSCL_   (1<<21)   // PB21
#define  bRXD2_  (1<<22)   // PB22
#define  bTMR3   (1<<22)   // PB22
#define  bCAP3   bTMR3
#define  bPWM3   bTMR3
#define  bRST    (1<<23)   // PB23
#define  bTMR0_  (1<<23)   // PB23
#define  bCAP0_  bTMR0_
#define  bPWM0_  bTMR0_
#define  bTXD2_  (1<<23)   // PB23
#define  bPWM11  (1<<23)   // PB23

/* System: Flash ROM control register */
#define R32_FLASH_DATA      (*((vu32*)0x40001800)) // RO/WO, flash ROM data
#define R32_FLASH_CONTROL   (*((vu32*)0x40001804)) // RW, flash ROM control, byte1 and byte3 need RWA
#define R8_FLASH_DATA       (*((vu8*)0x40001804))  // RO/WO, flash ROM data buffer
#define R8_FLASH_SCK        (*((vu8*)0x40001805))  // RW, flash ROM sck time config
#define R8_FLASH_CTRL       (*((vu8*)0x40001806))  // RW, flash ROM access control
#define R8_FLASH_CFG        (*((vu8*)0x40001807))  // RWA, flash ROM access config, SAM

/* Timer0 register */
#define R32_TMR0_CONTROL    (*((vu32*)0x40002000)) // RW, TMR0 control
#define R8_TMR0_CTRL_MOD    (*((vu8*)0x40002000))  // RW, TMR0 mode control
#define R8_TMR0_INTER_EN    (*((vu8*)0x40002002))  // RW, TMR0 interrupt enable
#define R32_TMR0_STATUS     (*((vu32*)0x40002004)) // RW, TMR0 status
#define R8_TMR0_INT_FLAG    (*((vu8*)0x40002006))  // RW1, TMR0 interrupt flag
#define R8_TMR0_FIFO_COUNT  (*((vu8*)0x40002007))  // RO, TMR0 FIFO count status
#define R32_TMR0_COUNT      (*((vu32*)0x40002008)) // RO, TMR0 current count
#define R16_TMR0_COUNT      (*((vu16*)0x40002008)) // RO, TMR0 current count
#define R8_TMR0_COUNT       (*((vu8*)0x40002008))  // RO, TMR0 current count
#define R32_TMR0_CNT_END    (*((vu32*)0x4000200C)) // RW, TMR0 end count value, only low 26 bit
#define R32_TMR0_FIFO       (*((vu32*)0x40002010)) // RO/WO, TMR0 FIFO register, only low 26 bit
#define R16_TMR0_FIFO       (*((vu16*)0x40002010)) // RO/WO, TMR0 FIFO register
#define R8_TMR0_FIFO        (*((vu8*)0x40002010))  // RO/WO, TMR0 FIFO register

